In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import linear_model

In [7]:
df =pd.read_csv('Documents//datasets//titanic.csv')

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.drop(['PassengerId' ,'Name' ,'SibSp','Parch','Cabin' ,'Ticket' ,'Embarked'] ,axis='columns' ,inplace=True)

In [11]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [13]:
target = df.Survived
inputs = df.drop('Survived' ,axis='columns')

In [14]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [15]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [17]:
dummies = pd.get_dummies(inputs.Sex)

In [19]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [20]:
inputss =pd.concat([inputs,dummies],axis='columns')
inputss.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [21]:
inputss.drop('Sex',axis='columns' ,inplace=True)

In [22]:
inputss.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [24]:
inputss.columns[inputss.isna().any()]

Index(['Age'], dtype='object')

In [26]:
inputss.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [27]:
inputss.Age = inputss.Age.fillna(inputss.Age.mean())

In [28]:
inputss.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [31]:
from sklearn.model_selection import train_test_split
x_train,x_test ,y_train,y_test = train_test_split(inputss,target,test_size=0.2)

In [34]:
len(x_train)

712

In [35]:
len(x_test)

179

In [36]:
len(inputss)

891

In [37]:
from sklearn.naive_bayes import GaussianNB
gau =GaussianNB()

In [38]:
gau.fit(x_train,y_train)

GaussianNB()

In [39]:
gau.score(x_test ,y_test)

0.7653631284916201

In [41]:
x_test[:10]

     Pclass   Age     Fare  female  male
120       2  21.0  73.5000       0     1
69        3  26.0   8.6625       0     1
772       2  57.0  10.5000       1     0
703       3  25.0   7.7417       0     1
331       1  45.5  28.5000       0     1
877       3  19.0   7.8958       0     1
163       3  17.0   8.6625       0     1
480       3   9.0  46.9000       0     1
649       3  23.0   7.5500       1     0
346       2  40.0  13.0000       1     0

In [43]:
y_test[:10]

120    0
69     0
772    0
703    0
331    0
877    0
163    0
480    0
649    1
346    1
Name: Survived, dtype: int64

In [44]:
gau.predict(x_test[:10])

array([0, 0, 1, 0, 0, 0, 0, 0, 1, 1])

In [45]:
gau.predict_proba(x_test[:10])# first value ,ddnt survived ,2nd value -0.8662.. survived

array([[0.91370187, 0.08629813],
       [0.99156861, 0.00843139],
       [0.02722986, 0.97277014],
       [0.99140604, 0.00859396],
       [0.92341488, 0.07658512],
       [0.99040948, 0.00959052],
       [0.98999046, 0.01000954],
       [0.98050631, 0.01949369],
       [0.0688385 , 0.9311615 ],
       [0.03514679, 0.96485321]])